{
  "projects": [
    {
      "title": "Gradient Website",
      "description": "The revamped Gradient Website, of which I'm a board member, addresses the shortcomings of its predecessor, which suffered from outdated UI design and was built on older frameworks. By modernizing the interface, I've enhanced user experience and accessibility. ",
      "phone_img": "gradient_phone.png",
      "desktop_img": "gradient.png",
      "badges": ["Next.js", "React", "Tailwind", "TypeScript"],
      "link": "https://gradient.eti.pg.gda.pl/"
    },
    {
      "title": "AS Roads Website",
      "description": "By implementing AS Roads' website with a polished UI/UX and leveraging Strapi for backend services, I've effectively addressed their previous lack of digital presence. Now, the website not only fills the gap but also enhances AS Roads' online visibility, marking a significant step forward in their digital journey.",
      "phone_img": "asroads_phone.png",
      "desktop_img": "asroads.png",
      "badges": ["Next.js", "React", "SCSS", "TypeScript"],
      "link": "https://asroads.org/"
    },
    {
      "title": "3KTR Website",
      "description": "I've solved 3KTR Design Studio's issue of not having an online presence and beautifully displayed all their projects, enhancing their visibility and attracting potential clients. This marks a significant stride in their digital journey and strengthens their position in the design industry.",
      "img": "movie.gif",
      "phone_img": "3ktr_phone.png",
      "desktop_img": "3ktr.png",
      "badges": ["Next.js", "React", "SCSS", "TypeScript"]
    },
    {
      "title": "Home Configurator",
      "description": "The Home Configurator, tailored for 3KTR, facilitates seamless transition between Unreal Engine and the web platform, enabling users to customize products with ease with automatic price calculation. By integrating these environments, customers can experience a fluid interaction while configuring their designs, enhancing engagement and satisfaction.",
      "phone_img": "3ktr_phone.png",
      "desktop_img": "home_configurator.png",
      "badges": ["Next.js", "SCSS", "TypeScript"] 
    }
  ]
}
